Repository: undershell/wp-avifs-uploader
Catalog: languages/avifs-uploader-*.po
Languages: ar, fr

source: AVIFS Uploader requires PHP version 5.6 or higher. Your current version is %s.
ar: يتطلب AVIFS Uploader إصدار PHP 5.6 أو أعلى. إصدارك الحالي هو %s.
fr: AVIFS Uploader nécessite PHP version 5.6 ou supérieure. Votre version actuelle est %s.

source: AVIFS Uploader requires WordPress version 4.7 or higher. Your current version is %s.
ar: يتطلب AVIFS Uploader إصدار ووردبريس 4.7 أو أعلى. إصدارك الحالي هو %s.
fr: AVIFS Uploader nécessite WordPress version 4.7 ou supérieure. Votre version actuelle est %s.

source: Settings
ar: الإعدادات
fr: Réglages

source: AVIFS Uploader Settings
ar: إعدادات AVIFS Uploader
fr: Réglages AVIFS Uploader

source: AVIFS Uploader
ar: رافع ملفات AVIFS

source: AVIFS Upload Settings
ar: إعدادات رفع AVIFS
fr: Réglages de téléversement AVIFS

source: Allowed User Roles
ar: أدوار المستخدمين المسموح بها
fr: Rôles utilisateur autorisés

source: Maximum File Size (MB)
ar: الحد الأقصى لحجم الملف (ميجابايت)
fr: Taille maximale du fichier (Mo)

source: Configure the settings for AVIFS Sequence file uploads.
ar: قم بتكوين إعدادات رفع ملفات تسلسل AVIFS.
fr: Configurez les réglages pour le téléversement des fichiers de séquence AVIFS.

source: MB
ar: ميجابايت
fr: Mo

source: Default: %1$d MB. WordPress maximum upload size: %2$d MB.
ar: الافتراضي: %1$d ميجابايت. الحد الأقصى لحجم الرفع في ووردبريس: %2$d ميجابايت.
fr: Défaut : %1$d Mo. Taille maximale de téléversement WordPress : %2$d Mo.

source: The uploads directory is not writable. AVIFS Uploader cannot update .htaccess for security.
ar: مجلد الرفع غير قابل للكتابة. لا يمكن لـ AVIFS Uploader تحديث ملف .htaccess للأمان.
fr: Le répertoire de téléversements n'est pas accessible en écriture. AVIFS Uploader ne peut pas mettre à jour .htaccess pour la sécurité.

source: Invalid AVIFS file.
ar: ملف AVIFS غير صالح.
fr: Fichier AVIFS invalide.

source: Your user role is not allowed to upload AVIFS Sequence files.
ar: دور المستخدم الخاص بك غير مسموح له برفع ملفات تسلسل AVIFS.
fr: Votre rôle utilisateur n'est pas autorisé à téléverser des fichiers de séquence AVIFS.

source: AVIF Sequence files must be smaller than %s MB.
ar: يجب أن تكون ملفات تسلسل AVIF أصغر من %s ميجابايت.
fr: Les fichiers de séquence AVIF doivent être plus petits que %s Mo.

source: AVIFS Uploader: Could not automatically update .htaccess. Please ensure your server is Apache with mod_mime enabled, and that the uploads directory is writable. You may need to manually add the following rules to your .htaccess file:
ar: AVIFS Uploader: تعذر تحديث ملف .htaccess تلقائيًا. يرجى التأكد من أن خادمك هو Apache مع تمكين mod_mime، وأن مجلد الرفع قابل للكتابة. قد تحتاج إلى إضافة القواعد التالية يدويًا إلى ملف .htaccess الخاص بك:
fr: AVIFS Uploader : Impossible de mettre à jour automatiquement .htaccess. Veuillez vous assurer que votre serveur est Apache avec mod_mime activé et que le répertoire de téléversements est accessible en écriture. Vous devrez peut-être ajouter manuellement les règles suivantes à votre fichier .htaccess :
